/**
     Заполните новый массив (result) числами из старого (arr). Количество элементов в массиве 
     можно получить как arr.length, а к элементам обращаемся все так же: arr[0], arr[1] и тд.
    Должен получиться точно такой же массив

    Измените данный массив так, чтобы все числа были увеличены в 2 раза, а если попадается 
    строка строка - то к ней было добавлено " - done".
    Для определения типа данных используйте typeof();
    Должно получиться: [ 10, 20, 'Shopping - done', 40, 'Homework - done' ]

    Разверните массив data наоборот при помощи цикла и запишите данные в массив result.
    Должно получиться: [ 'Homework', 20, 'Shopping', 10, 5 ]

 */
